# Напишите программу, которая перевернёт одномерный массив (первый элемент станет последним, второй – предпоследним и т.д.)

# Исходный массив
array = [1, 2, 3, 4, 5]
print(f"Исходный массив: {array}")

# Переворачиваем массив
reversed_array = array[::-1]
print(f"Перевёрнутый массив: {reversed_array}")
